In [1]:
import pandas as pd

In [3]:
## Series
## Pandas Series is a one-dimensional array-like object that can hold any data type. It is similar to a colom in table

import pandas as pd
data=[x for x in range(100)]
series = pd.Series(data)
print("Series: \n", series)
print(type(series))

Series:
 0      0
1      1
2      2
3      3
4      4
      ..
95    95
96    96
97    97
98    98
99    99
Length: 100, dtype: int64
<class 'pandas.core.series.Series'>

In [4]:
## Create a series from dictionary element
data = {'a':1,'b':2,'c':3}
series_dict=pd.Series(data)
print(series_dict)

a    1
b    2
c    3
dtype: int64

In [14]:
## Dataframe
## create a Dataframe from a dictionary of list

data = {
  'name':['Deka','Krish','Rifqi'],
  'Age':[21,32,23],
  'City':['Jonggol','Bangalore','Cileungsi']
}

df = pd.DataFrame(data)
print(df)
print(type(df))

    name  Age       City
0   Deka   21    Jonggol
1  Krish   32  Bangalore
2  Rifqi   23  Cileungsi
<class 'pandas.core.frame.DataFrame'>

In [7]:
import numpy as np
np.array(df)

array([['Deka', 21, 'Jonggol'],
       ['Krish', 32, 'Bangalore'],
       ['Rifqi', 23, 'Cileungsi']], dtype=object)

In [9]:
## Create a Data frame From a List of Dictionaries

data = [
  {'Name':'Deka','Age':21,'City':'Bogor'},
  {'Name':'Jhon','Age':23,'City':'Bogay'},
  {'Name':'Dinggo','Age':34,'City':'Bogor'},
  {'Name':'Dono','Age':21,'City':'Bogor'}
]
df = pd.DataFrame(data)
print(df)

     Name  Age   City
0    Deka   21  Bogor
1    Jhon   23  Bogay
2  Dinggo   34  Bogor
3    Dono   21  Bogor

In [11]:
df=pd.read_csv('sales_data.csv')
df.head(5)

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
0,10001,2024-01-01,Electronics,iPhone 14 Pro,2,999.99,1999.98,North America,Credit Card
1,10002,2024-01-02,Home Appliances,Dyson V11 Vacuum,1,499.99,499.99,Europe,PayPal
2,10003,2024-01-03,Clothing,Levi's 501 Jeans,3,69.99,209.97,Asia,Debit Card
3,10004,2024-01-04,Books,The Da Vinci Code,4,15.99,63.96,North America,Credit Card
4,10005,2024-01-05,Beauty Products,Neutrogena Skincare Set,1,89.99,89.99,Europe,PayPal

In [12]:
df.tail(5)

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
235,10236,2024-08-23,Home Appliances,Nespresso Vertuo Next Coffee and Espresso Maker,1,159.99,159.99,Europe,PayPal
236,10237,2024-08-24,Clothing,Nike Air Force 1 Sneakers,3,90.00,270.00,Asia,Debit Card
237,10238,2024-08-25,Books,The Handmaid's Tale by Margaret Atwood,3,10.99,32.97,North America,Credit Card
238,10239,2024-08-26,Beauty Products,Sunday Riley Luna Sleeping Night Oil,1,55.00,55.00,Europe,PayPal
239,10240,2024-08-27,Sports,Yeti Rambler 20 oz Tumbler,2,29.99,59.98,Asia,Credit Card

In [ ]:
### Accessing Data From DataFrame
df['name']

pandas.core.series.Series

In [21]:
df.loc[0]

name       Deka
Age          21
City    Jonggol
Name: 0, dtype: object

In [31]:
df.iloc[0][1]

C:\Users\MyBook Z Series\AppData\Local\Temp\ipykernel_17244\2309508539.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.iloc[0][1]

np.int64(21)

In [34]:
df

    name  Age       City
0   Deka   21    Jonggol
1  Krish   32  Bangalore
2  Rifqi   23  Cileungsi

In [35]:
## Accessing a specified element
df.iat[2,2]

'Cileungsi'

In [36]:
### Data Manipulation with DataFrame
df

    name  Age       City
0   Deka   21    Jonggol
1  Krish   32  Bangalore
2  Rifqi   23  Cileungsi

In [37]:
df['Salary']=[100000,200000,50000]

In [38]:
df

    name  Age       City  Salary
0   Deka   21    Jonggol  100000
1  Krish   32  Bangalore  200000
2  Rifqi   23  Cileungsi   50000

In [41]:
## Remove a colummn
df.drop('Salary', axis=1,inplace=True)

In [42]:
df

    name  Age       City
0   Deka   21    Jonggol
1  Krish   32  Bangalore
2  Rifqi   23  Cileungsi

In [45]:
## Add age to the column
df['Age']-1

0    20
1    31
2    22
Name: Age, dtype: int64

In [46]:
df

    name  Age       City
0   Deka   21    Jonggol
1  Krish   32  Bangalore
2  Rifqi   23  Cileungsi

In [47]:
df.drop(0)

    name  Age       City
1  Krish   32  Bangalore
2  Rifqi   23  Cileungsi

In [48]:
df=pd.read_csv('sales_data.csv')
df.head(5)

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
0,10001,2024-01-01,Electronics,iPhone 14 Pro,2,999.99,1999.98,North America,Credit Card
1,10002,2024-01-02,Home Appliances,Dyson V11 Vacuum,1,499.99,499.99,Europe,PayPal
2,10003,2024-01-03,Clothing,Levi's 501 Jeans,3,69.99,209.97,Asia,Debit Card
3,10004,2024-01-04,Books,The Da Vinci Code,4,15.99,63.96,North America,Credit Card
4,10005,2024-01-05,Beauty Products,Neutrogena Skincare Set,1,89.99,89.99,Europe,PayPal

In [49]:
# Display the data types of each column
print("Data type:\n",df.dtypes)

# Describe the DataFrame
print("Statistical Summary:\n",df.describe())

# Group by a column and perform an agregation
grouped = df.groupby('Category')['Value'].mean()
print('Mean value by category:\n', grouped)

Data type:
 Transaction ID        int64
Date                 object
Product Category     object
Product Name         object
Units Sold            int64
Unit Price          float64
Total Revenue       float64
Region               object
Payment Method       object
dtype: object
Statistical Summary:
        Transaction ID  Units Sold   Unit Price  Total Revenue
count       240.00000  240.000000   240.000000     240.000000
mean      10120.50000    2.158333   236.395583     335.699375
std          69.42622    1.322454   429.446695     485.804469
min       10001.00000    1.000000     6.500000       6.500000
25%       10060.75000    1.000000    29.500000      62.965000
50%       10120.50000    2.000000    89.990000     179.970000
75%       10180.25000    3.000000   249.990000     399.225000
max       10240.00000   10.000000  3899.990000    3899.990000

KeyError: 'Category'

In [50]:
df.describe()

       Transaction ID  Units Sold   Unit Price  Total Revenue
count       240.00000  240.000000   240.000000     240.000000
mean      10120.50000    2.158333   236.395583     335.699375
std          69.42622    1.322454   429.446695     485.804469
min       10001.00000    1.000000     6.500000       6.500000
25%       10060.75000    1.000000    29.500000      62.965000
50%       10120.50000    2.000000    89.990000     179.970000
75%       10180.25000    3.000000   249.990000     399.225000
max       10240.00000   10.000000  3899.990000    3899.990000